cmsis-svd/cmsis-svd/data/Spansion/MB9BF42xS.svd
<?xml version="1.0" encoding="utf-8"?>
<!-- ************************************************************************ -->
<!-- Licence Terms                                                            -->
<!-- ************************************************************************ -->
<!--                                                                          -->
<!-- FUJITSU SEMICONDUCTOR LIMITED (gLICENSORh) hereby grants and             -->
<!-- you (gLICENSEEh) hereby accept a non transferable, non-exclusive         -->
<!-- licence to use and copy the deliverables (gDeliverablesh) solely for     -->
<!-- the purpose of; (i) developing LICENSEEfs development tools and          -->
<!-- distributing such development tools to third parties; (ii) generating    -->
<!-- derivative representations of the Deliverables to develop and debug      -->
<!-- software for LICENSORfs targeted devices or device series identified     -->
<!-- within the Deliverables, (together the gPurposeh) under the following    -->
<!-- terms and conditions:                                                    -->
<!--                                                                          -->
<!-- 1. Ownership.                                                            -->
<!-- The Deliverables are the property of LICENSOR. LICENSEE acquires no      -->
<!-- right, title or interest in the Deliverables other than the licence      -->
<!-- rights granted herein.                                                   -->
<!--                                                                          -->
<!-- 2. Use.                                                                  -->
<!-- LICENSEE shall only be permitted to use the Deliverables for the         -->
<!-- Purpose. LICENSEE shall not reverse engineer, decompile or               -->
<!-- disassemble the Deliverables, in whole or in part.                       -->
<!--                                                                          -->
<!-- 3. Copies.                                                               -->
<!-- All copies of the Deliverables must bear the same notice(s) contained    -->
<!-- on the original copies of the Deliverables.                              -->
<!--                                                                          -->
<!-- 4. No Warranty.                                                          -->
<!-- THE DELIVERABLES ARE PROVIDED gAS ISh AND ANY EXPRESS, IMPLIED OR        -->
<!-- STATUTORY WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED         -->
<!-- WARRANTIES OF MERCHANTABILITY, SATISFACTORY QUALITY AND FITNESS FOR      -->
<!-- A PARTICULAR PURPOSE ARE DISCLAIMED.                                     -->
<!-- IN NO EVENT SHALL LICENSOR BE LIABLE FOR ANY DIRECT, INDIRECT,           -->
<!-- INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES HOWEVER CAUSED  -->
<!-- AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,   -->
<!-- OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF    -->
<!-- THE USE OF THE DELIVERABLES, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH  -->
<!-- DAMAGE.                                                                  -->
<!-- LICENSEE EXPRESSLY ASSUMES ALL LIABILITIES AND RISKS, FOR USE OR         -->
<!-- OPERATION OF THE DELIVERABLES.                                           -->
<!--                                                                          -->
<!-- 5.In the event that LICENSEE receives early access to the Deliverables,  -->
<!-- LICENSEE acknowledges and agrees that;                                   -->
<!-- (a) notwithstanding the licence grants above, LICENSEE shall only be     -->
<!-- permitted to use the Deliverables solely internally for evaluation and   -->
<!-- providing feedback to LICENSOR;                                          -->
<!-- (b) except with respect to the limited licence grants in 5(a), LICENSEE  -->
<!-- shall be subject to all of the terms and conditions set out above; and   -->
<!-- (c) the Deliverables are confidential information and LICENSEE shall     -->
<!-- maintain in confidence the Deliverables and apply security measures no   -->
<!-- less stringent than the measures that LICENSEE applies to its own like   -->
<!-- information, but not less than a reasonable degree of care, to prevent   -->
<!-- unauthorised disclosure and use of the Deliverables.                     -->
<!--                                                                          -->
<!-- ************************************************************************ -->
<!-- 2013.7.2 generated by svdgen_v02c -->
<device schemaVersion="1.0" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_0.xsd">
 <name>MB9BF42xS</name>
 <version>1.0</version>
 <description>MB9BF42xS</description>
 <addressUnitBits>8</addressUnitBits>
 <width>32</width>
 <size>32</size>
 <access>read-write</access>
 <resetValue>0x00000000</resetValue>
 <resetMask>0x00000000</resetMask>
 <peripherals>
   <!-- ************************************************************************************** -->
   <!-- peripheral:FlashMemory -->
   <!-- ************************************************************************************** -->
    <!-- PERIPHERAL "FLASH_IF" -->
    <peripheral>
      <name>FLASH_IF</name>
      <description> peripheral FLASH_IF </description>
      <groupName>FLASH_IF</groupName>
      <baseAddress>0x40000000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x4</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x88</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x100</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "FRWTR" -->
        <register>
          <name>FRWTR</name>
          <description> register FRWTR </description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RWT" -->
            <field>
              <name>RWT</name>
              <description> bitfield RWT </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FSTR" -->
        <register>
          <name>FSTR</name>
          <description> register FSTR </description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PGMS" -->
            <field>
              <name>PGMS</name>
              <description> bitfield PGMS </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SERS" -->
            <field>
              <name>SERS</name>
              <description> bitfield SERS </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ESPS" -->
            <field>
              <name>ESPS</name>
              <description> bitfield ESPS </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CERS" -->
            <field>
              <name>CERS</name>
              <description> bitfield CERS </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "HNG" -->
            <field>
              <name>HNG</name>
              <description> bitfield HNG </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RDY" -->
            <field>
              <name>RDY</name>
              <description> bitfield RDY </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
