cmsis-svd/cmsis-svd/data/Spansion/MB9BF42xS.svd
      </registers>
    </peripheral>
    <!-- PERIPHERAL "BTIOSEL8B" -->
    <peripheral>
      <name>BTIOSEL8B</name>
      <description> peripheral BTIOSEL8B </description>
      <groupName>BTIOSEL8B</groupName>
      <baseAddress>0x40025500</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "BTSEL89AB" -->
        <register>
          <name>BTSEL89AB</name>
          <description> register BTSEL89AB </description>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SELAB_" -->
            <field>
              <name>SELAB_</name>
              <description> bitfield SELAB_ </description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEL89_" -->
            <field>
              <name>SEL89_</name>
              <description> bitfield SEL89_ </description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "BTIOSELCF" -->
    <peripheral>
      <name>BTIOSELCF</name>
      <description> peripheral BTIOSELCF </description>
      <groupName>BTIOSELCF</groupName>
      <baseAddress>0x40025700</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "BTSELCDEF" -->
        <register>
          <name>BTSELCDEF</name>
          <description> register BTSELCDEF </description>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SELEF_" -->
            <field>
              <name>SELEF_</name>
              <description> bitfield SELEF_ </description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELCD_" -->
            <field>
              <name>SELCD_</name>
              <description> bitfield SELCD_ </description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "SBSSR" -->
    <peripheral>
      <name>SBSSR</name>
      <description> peripheral SBSSR </description>
      <groupName>SBSSR</groupName>
      <baseAddress>0x40025F00</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0FC</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "BTSSSR" -->
        <register>
          <name>BTSSSR</name>
          <description> register BTSSSR </description>
          <addressOffset>0xFC</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0000</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SSSR15" -->
            <field>
              <name>SSSR15</name>
              <description> bitfield SSSR15 </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR14" -->
            <field>
              <name>SSSR14</name>
              <description> bitfield SSSR14 </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR13" -->
            <field>
              <name>SSSR13</name>
              <description> bitfield SSSR13 </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR12" -->
            <field>
              <name>SSSR12</name>
              <description> bitfield SSSR12 </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR11" -->
            <field>
              <name>SSSR11</name>
              <description> bitfield SSSR11 </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR10" -->
            <field>
              <name>SSSR10</name>
              <description> bitfield SSSR10 </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR9" -->
            <field>
              <name>SSSR9</name>
              <description> bitfield SSSR9 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR8" -->
            <field>
              <name>SSSR8</name>
              <description> bitfield SSSR8 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR7" -->
            <field>
              <name>SSSR7</name>
              <description> bitfield SSSR7 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR6" -->
            <field>
              <name>SSSR6</name>
              <description> bitfield SSSR6 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR5" -->
            <field>
              <name>SSSR5</name>
              <description> bitfield SSSR5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR4" -->
            <field>
              <name>SSSR4</name>
              <description> bitfield SSSR4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR3" -->
            <field>
              <name>SSSR3</name>
              <description> bitfield SSSR3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR2" -->
            <field>
              <name>SSSR2</name>
              <description> bitfield SSSR2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR1" -->
            <field>
              <name>SSSR1</name>
              <description> bitfield SSSR1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR0" -->
            <field>
              <name>SSSR0</name>
              <description> bitfield SSSR0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
