cmsis-svd/cmsis-svd/data/Spansion/MB9BF42xS.svd
        <!-- REGISTER "IRQ20MON" -->
        <register>
          <name>IRQ20MON</name>
          <description> register IRQ20MON </description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT3" -->
            <field>
              <name>MFSINT3</name>
              <description> bitfield MFSINT3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT2" -->
            <field>
              <name>MFSINT2</name>
              <description> bitfield MFSINT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT1" -->
            <field>
              <name>MFSINT1</name>
              <description> bitfield MFSINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT0" -->
            <field>
              <name>MFSINT0</name>
              <description> bitfield MFSINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ21MON" -->
        <register>
          <name>IRQ21MON</name>
          <description> register IRQ21MON </description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT1" -->
            <field>
              <name>MFSINT1</name>
              <description> bitfield MFSINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT0" -->
            <field>
              <name>MFSINT0</name>
              <description> bitfield MFSINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ22MON" -->
        <register>
          <name>IRQ22MON</name>
          <description> register IRQ22MON </description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT3" -->
            <field>
              <name>MFSINT3</name>
              <description> bitfield MFSINT3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT2" -->
            <field>
              <name>MFSINT2</name>
              <description> bitfield MFSINT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT1" -->
            <field>
              <name>MFSINT1</name>
              <description> bitfield MFSINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT0" -->
            <field>
              <name>MFSINT0</name>
              <description> bitfield MFSINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ23MON" -->
        <register>
          <name>IRQ23MON</name>
          <description> register IRQ23MON </description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PPGINT2" -->
            <field>
              <name>PPGINT2</name>
              <description> bitfield PPGINT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "PPGINT1" -->
            <field>
              <name>PPGINT1</name>
              <description> bitfield PPGINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "PPGINT0" -->
            <field>
              <name>PPGINT0</name>
              <description> bitfield PPGINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ24MON" -->
        <register>
          <name>IRQ24MON</name>
          <description> register IRQ24MON </description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RTCINT" -->
            <field>
              <name>RTCINT</name>
              <description> bitfield RTCINT </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WCINT" -->
            <field>
              <name>WCINT</name>
              <description> bitfield WCINT </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UPLLINT" -->
            <field>
              <name>UPLLINT</name>
              <description> bitfield UPLLINT </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MPLLINT" -->
            <field>
              <name>MPLLINT</name>
              <description> bitfield MPLLINT </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SOSCINT" -->
            <field>
              <name>SOSCINT</name>
              <description> bitfield SOSCINT </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MOSCINT" -->
            <field>
              <name>MOSCINT</name>
              <description> bitfield MOSCINT </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ25MON" -->
        <register>
          <name>IRQ25MON</name>
          <description> register IRQ25MON </description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ADCINT3" -->
            <field>
              <name>ADCINT3</name>
              <description> bitfield ADCINT3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ADCINT2" -->
            <field>
              <name>ADCINT2</name>
              <description> bitfield ADCINT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ADCINT1" -->
            <field>
              <name>ADCINT1</name>
              <description> bitfield ADCINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ADCINT0" -->
            <field>
              <name>ADCINT0</name>
              <description> bitfield ADCINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ26MON" -->
        <register>
          <name>IRQ26MON</name>
          <description> register IRQ26MON </description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ADCINT3" -->
            <field>
              <name>ADCINT3</name>
              <description> bitfield ADCINT3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ADCINT2" -->
            <field>
              <name>ADCINT2</name>
              <description> bitfield ADCINT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ADCINT1" -->
            <field>
              <name>ADCINT1</name>
              <description> bitfield ADCINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ADCINT0" -->
            <field>
              <name>ADCINT0</name>
              <description> bitfield ADCINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ27MON" -->
        <register>
          <name>IRQ27MON</name>
          <description> register IRQ27MON </description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
        </register>
