cmsis-svd/cmsis-svd/data/Spansion/MB9BF42xS.svd
        <!-- REGISTER "TXSTS" -->
        <register>
          <name>TXSTS</name>
          <description> register TXSTS </description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x31</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IBR" -->
            <field>
              <name>IBR</name>
              <description> bitfield IBR </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ITST" -->
            <field>
              <name>ITST</name>
              <description> bitfield ITST </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ACKSV" -->
            <field>
              <name>ACKSV</name>
              <description> bitfield ACKSV </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SFREE" -->
        <register>
          <name>SFREE</name>
          <description> register SFREE </description>
          <addressOffset>0xC</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SFREE" -->
            <field>
              <name>SFREE</name>
              <description> bitfield SFREE </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RCST" -->
        <register>
          <name>RCST</name>
          <description> register RCST </description>
          <addressOffset>0x40</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STIE" -->
            <field>
              <name>STIE</name>
              <description> bitfield STIE </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ACKIE" -->
            <field>
              <name>ACKIE</name>
              <description> bitfield ACKIE </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OVFIE" -->
            <field>
              <name>OVFIE</name>
              <description> bitfield OVFIE </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OVFSEL" -->
            <field>
              <name>OVFSEL</name>
              <description> bitfield OVFSEL </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ST" -->
            <field>
              <name>ST</name>
              <description> bitfield ST </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ACK" -->
            <field>
              <name>ACK</name>
              <description> bitfield ACK </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EOM" -->
            <field>
              <name>EOM</name>
              <description> bitfield EOM </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OVF" -->
            <field>
              <name>OVF</name>
              <description> bitfield OVF </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RCCR" -->
        <register>
          <name>RCCR</name>
          <description> register RCCR </description>
          <addressOffset>0x41</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x8F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "THSEL" -->
            <field>
              <name>THSEL</name>
              <description> bitfield THSEL </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADRCE" -->
            <field>
              <name>ADRCE</name>
              <description> bitfield ADRCE </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOD1" -->
            <field>
              <name>MOD1</name>
              <description> bitfield MOD1 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOD0" -->
            <field>
              <name>MOD0</name>
              <description> bitfield MOD0 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN" -->
            <field>
              <name>EN</name>
              <description> bitfield EN </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RCDAHW" -->
        <register>
          <name>RCDAHW</name>
          <description> register RCDAHW </description>
          <addressOffset>0x44</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCDAHW" -->
            <field>
              <name>RCDAHW</name>
              <description> bitfield RCDAHW </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RCSHW" -->
        <register>
          <name>RCSHW</name>
          <description> register RCSHW </description>
          <addressOffset>0x45</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCSHW" -->
            <field>
              <name>RCSHW</name>
              <description> bitfield RCSHW </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RCDBHW" -->
        <register>
          <name>RCDBHW</name>
          <description> register RCDBHW </description>
          <addressOffset>0x49</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCDBHW" -->
            <field>
              <name>RCDBHW</name>
              <description> bitfield RCDBHW </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
